<?php include 'header.php'; ?>
<header id="header-image" class="header-image"></header>

<main id="content" class="content-section">
  <div class="container">
    <section class="director">
      <div class="director_box">
        <div class="box_tit">
          <h2>Давайте знакомится!</h2>
        </div>
        <div class="director-box-bottom">
          <div class="director_content_box">
            <div class="director_img">
              <img src="img/director.jpg" class="clearfix">
            </div>
          </div>
          <div class="director_poragraph">
            <p>
              Этот контент после успешнго завершения презинтауии будет передан для редактирования дтректору сш №1 Ли Н.А.
              <br><br>
              Также наша команда уверенна в том что этот контент будет очень важен для пользователей.
            </p>
            <br><br>
            <span class="director-signature">Ли Н.А. Директор</span>
          </div>
        </div>
      </div>
    </section>
    <section class="rooms">
      <div class="rooms_container">
        <div class="box_tit">
          <h2>Помещения</h2>
        </div>
        <div class="rooms_poragraph">
          <p class="rooms-desc">
            Школа это место где человек учится жизни и жизненым навыком, и нашей осномной целью является создание всех условий для этого. Помимо лучших учителей, у нас есть...
          </p>
        </div>
        <div class="rooms_content" id="swipe-slider">
          <div class="room-box">
            <div class="room-box-img" style="background-image: url(img/photo_2019-09-28_11-23-36.jpg)"></div>
            <p class="room-box-desc">
              По актовому залу можно понять как васпитывают учеников в школе, "почему?" спосите вы а ведь причина проста... Посмотрите как наши ученики доброльцы сами украсили актовый зал! Так же стоит отметить что в нашей школе актовый зал очень большой: хх метров в длину и уу метров в ширину
            </p>
          </div>
          <div class="room-box">
            <p class="room-box-desc">
              В нашей школе есть огромная библиотека с огромным количеством книг, около ххх на руском и ууу на узбекском языках Сдесь вы можете конфортно насладится чтение вашей любимой книги.
            </p>
            <div class="room-box-img" style="background-image: url(img/library.jpg)"></div>
          </div>
          <div class="room-box">
            <div class="room-box-img" style="background-image: url(img/20190507_120934.jpg)"></div>
            <p class="room-box-desc">
               Спорт зал это место где человек получает физическое воспитание, и наша школа заботится что бы оно прошло максималь конфортно для учеников, поэтому кроме огромного спортивного инверторя в нашей школе действует 2 спорт зала.
            </p>
          </div>
          <div class="room-box">
            <p class="room-box-desc">
               Столовая неотемлемая часть школьной жизини, и после усердий проявленных на уроках не возможно обойти школьную столовую стороной, не отведав горячих и вкусных блюд на перемене. В нашей столовой идиальная чистота и огромный выбор блюд, которые так любят ученики нашей школы.
           </p>
            <div class="room-box-img" style="background-image: url(img/canteen2.jpg)"></div>
          </div>
        </div>
        <div id="slider-control">
          <button id="slider-to-prev" class="slider-to-prev">Предыдущий</button>
          <button id="slider-to-next" class="slider-to-next">Следующий</button>
        </div>
      </div>
    </section>
    <section class="history">
      <div class="history_container">
        <div class="box_tit">
          <h2>О нашей школе</h2>
        </div>
        <blockquote class="box-tit-q">
          <p><q>Спираль времен бесконечна, и сменяющие её друг друга поколения лишь восходят словно по лестнице, от ступени к ступени. Каждое поколение передает накопленный опыт следующиму поколению, которое будет развивать и обогащать его в дальнешем.</q></p>
        </blockquote>
        <!-- blocks -->
        <div class="history-block">
          <h2>Краткая история</h2>
          <!--общие сведенья-->
          <p>
            Средняя школа №1 была организованна 1939 году, в следствии чего и была под номером "39" Наша школа была одной из трех школ в Уртарчикчикском районе.
          </p>
          <p>
            До 1939 года обучение в районе велось семи летние и проходило на узбекском языке. А с первого сентября 1939 в нашей школе впервые открыли классы с русским языком обучения
            благодаря чему школе №39 было присвоенно имя А.С.Пушкина, которое она с честью и по сегодняшний день.
            До появление типового здания (ул.Комунистичесакя, тупик 2.) школа располагалась в здании детского сада №1, затем в здании бывшего архива по улице Пролетарская.
            В 1953 году получает новый номер "1" благодаря лучшим показателям.
          </p>
          <!--Директора-->
          <p>
            Первым директором нашей школы был Хван Григорий Львович. Стоит отметить что он был ветеранном педагогического труда, заслуженный учитель республики.
          </p>
          <p>
            На данный момент нашей школой управляет мудрый и справидливый директор под чьим руководством был созданн этот сайт, проведенны многие работы по повышению уровня образования Ли Наталья Алигелиевна.
          </p>
          <p>
            С момента формирования нашей школы у нас работают передовые народные учителя такие как: Ефросинья Яковленна, Татарницева Полина Алексевна, Кулин Степан Сафронович награжденный за педогогический и ратный труд. Будучи пожилым человеком, он ушел на фронт в качестве повара и со своей кухней дошел до Берлина. Возвратившись с войны он продолжал учить детей грамоте и патриотизму. Также наша школа может гордится усителем Одыл Файзиевич Файзиев, который был образцом для подражания не только для учеников но и учителей, не даром он возглавлял отдел в течении многих
            лет Уртачирчикский отдел народного образования.
          </p>
          <p>
            В 1948 наша школа разделилась на 2 самомтоятельные школы: школа №39 с русским языком образования и школа №4 с узбекским языком образования
          </p>
          <p>
            В 1987 году в нашей школе случилась катострофа ведь после пожара здание стало не пригодным Но в 1989 году была построенна новая школа по адрессу О.Шарафуддинова 1и
          </p>
        </div>
      </div>
    </section>
  </div>
</main>

<?php include 'footer.php'; ?>
<script src="scripts/swipe-slider.js"></script>

<script>
  let removeSliderFeatures = null;
  function wrapRoomsBySliderIfLess920() {
    if (window.innerWidth <= 920) {
      if (removeSliderFeatures == null) {
        removeSliderFeatures = createSwipeSlider({
          id: 'swipe-slider',
          toLeftId: 'slider-to-prev',
          toRightId: 'slider-to-next',
        });
      }
    } else {
      if (removeSliderFeatures) {
        removeSliderFeatures();
        removeSliderFeatures = null;
      }
    }
  }

  wrapRoomsBySliderIfLess920();
  window.addEventListener('resize', wrapRoomsBySliderIfLess920);
</script>

</body>
</html>
